results/k6-results.txt

         /\      Grafana   /ΓÇ╛ΓÇ╛/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ΓÇ╛ΓÇ╛\ 
  /          \   |   (  |  (ΓÇ╛)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: load-test/peak-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 1m30s max duration (incl. graceful stop):
              * satu_juta_transaksi: Up to 50 looping VUs for 1m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 04/50 VUs, 16 complete and 0 interrupted iterations
satu_juta_transaksi   [   2% ] 04/50 VUs  0m01.0s/1m00.0s

running (0m02.0s), 09/50 VUs, 81 complete and 0 interrupted iterations
satu_juta_transaksi   [   3% ] 09/50 VUs  0m02.0s/1m00.0s

running (0m03.0s), 14/50 VUs, 196 complete and 0 interrupted iterations
satu_juta_transaksi   [   5% ] 14/50 VUs  0m03.0s/1m00.0s

running (0m04.0s), 19/50 VUs, 355 complete and 0 interrupted iterations
satu_juta_transaksi   [   7% ] 19/50 VUs  0m04.0s/1m00.0s

running (0m05.0s), 24/50 VUs, 570 complete and 0 interrupted iterations
satu_juta_transaksi   [   8% ] 24/50 VUs  0m05.0s/1m00.0s

running (0m06.0s), 29/50 VUs, 829 complete and 0 interrupted iterations
satu_juta_transaksi   [  10% ] 29/50 VUs  0m06.0s/1m00.0s

running (0m07.0s), 34/50 VUs, 1138 complete and 0 interrupted iterations
satu_juta_transaksi   [  12% ] 34/50 VUs  0m07.0s/1m00.0s

running (0m08.0s), 39/50 VUs, 1493 complete and 0 interrupted iterations
satu_juta_transaksi   [  13% ] 39/50 VUs  0m08.0s/1m00.0s

running (0m09.0s), 44/50 VUs, 1896 complete and 0 interrupted iterations
satu_juta_transaksi   [  15% ] 44/50 VUs  0m09.0s/1m00.0s

running (0m10.0s), 49/50 VUs, 2354 complete and 0 interrupted iterations
satu_juta_transaksi   [  17% ] 49/50 VUs  0m10.0s/1m00.0s

running (0m11.0s), 50/50 VUs, 2834 complete and 0 interrupted iterations
satu_juta_transaksi   [  18% ] 50/50 VUs  0m11.0s/1m00.0s

running (0m12.0s), 50/50 VUs, 3325 complete and 0 interrupted iterations
satu_juta_transaksi   [  20% ] 50/50 VUs  0m12.0s/1m00.0s

running (0m13.0s), 50/50 VUs, 3803 complete and 0 interrupted iterations
satu_juta_transaksi   [  22% ] 50/50 VUs  0m13.0s/1m00.0s

running (0m14.0s), 50/50 VUs, 4253 complete and 0 interrupted iterations
satu_juta_transaksi   [  23% ] 50/50 VUs  0m14.0s/1m00.0s

running (0m15.0s), 50/50 VUs, 4714 complete and 0 interrupted iterations
satu_juta_transaksi   [  25% ] 50/50 VUs  0m15.0s/1m00.0s

running (0m16.0s), 50/50 VUs, 5182 complete and 0 interrupted iterations
satu_juta_transaksi   [  27% ] 50/50 VUs  0m16.0s/1m00.0s

running (0m17.0s), 50/50 VUs, 5639 complete and 0 interrupted iterations
satu_juta_transaksi   [  28% ] 50/50 VUs  0m17.0s/1m00.0s

running (0m18.0s), 50/50 VUs, 6075 complete and 0 interrupted iterations
satu_juta_transaksi   [  30% ] 50/50 VUs  0m18.0s/1m00.0s

running (0m19.0s), 50/50 VUs, 6539 complete and 0 interrupted iterations
satu_juta_transaksi   [  32% ] 50/50 VUs  0m19.0s/1m00.0s

running (0m20.0s), 50/50 VUs, 7003 complete and 0 interrupted iterations
satu_juta_transaksi   [  33% ] 50/50 VUs  0m20.0s/1m00.0s

running (0m21.0s), 50/50 VUs, 7448 complete and 0 interrupted iterations
satu_juta_transaksi   [  35% ] 50/50 VUs  0m21.0s/1m00.0s

running (0m22.0s), 50/50 VUs, 7905 complete and 0 interrupted iterations
satu_juta_transaksi   [  37% ] 50/50 VUs  0m22.0s/1m00.0s

running (0m23.0s), 50/50 VUs, 8343 complete and 0 interrupted iterations
satu_juta_transaksi   [  38% ] 50/50 VUs  0m23.0s/1m00.0s

running (0m24.0s), 50/50 VUs, 8785 complete and 0 interrupted iterations
satu_juta_transaksi   [  40% ] 50/50 VUs  0m24.0s/1m00.0s

running (0m25.0s), 50/50 VUs, 9243 complete and 0 interrupted iterations
satu_juta_transaksi   [  42% ] 50/50 VUs  0m25.0s/1m00.0s

running (0m26.0s), 50/50 VUs, 9682 complete and 0 interrupted iterations
satu_juta_transaksi   [  43% ] 50/50 VUs  0m26.0s/1m00.0s

running (0m27.0s), 50/50 VUs, 10132 complete and 0 interrupted iterations
satu_juta_transaksi   [  45% ] 50/50 VUs  0m27.0s/1m00.0s

running (0m28.0s), 50/50 VUs, 10585 complete and 0 interrupted iterations
satu_juta_transaksi   [  47% ] 50/50 VUs  0m28.0s/1m00.0s

running (0m29.0s), 50/50 VUs, 11025 complete and 0 interrupted iterations
satu_juta_transaksi   [  48% ] 50/50 VUs  0m29.0s/1m00.0s

running (0m30.0s), 50/50 VUs, 11508 complete and 0 interrupted iterations
satu_juta_transaksi   [  50% ] 50/50 VUs  0m30.0s/1m00.0s

running (0m31.0s), 50/50 VUs, 11970 complete and 0 interrupted iterations
satu_juta_transaksi   [  52% ] 50/50 VUs  0m31.0s/1m00.0s

running (0m32.0s), 50/50 VUs, 12425 complete and 0 interrupted iterations
satu_juta_transaksi   [  53% ] 50/50 VUs  0m32.0s/1m00.0s

running (0m33.0s), 50/50 VUs, 12842 complete and 0 interrupted iterations
satu_juta_transaksi   [  55% ] 50/50 VUs  0m33.0s/1m00.0s

running (0m34.0s), 50/50 VUs, 13276 complete and 0 interrupted iterations
satu_juta_transaksi   [  57% ] 50/50 VUs  0m34.0s/1m00.0s

running (0m35.0s), 50/50 VUs, 13735 complete and 0 interrupted iterations
satu_juta_transaksi   [  58% ] 50/50 VUs  0m35.0s/1m00.0s

running (0m36.0s), 50/50 VUs, 14179 complete and 0 interrupted iterations
satu_juta_transaksi   [  60% ] 50/50 VUs  0m36.0s/1m00.0s

running (0m37.0s), 50/50 VUs, 14633 complete and 0 interrupted iterations
satu_juta_transaksi   [  62% ] 50/50 VUs  0m37.0s/1m00.0s

running (0m38.0s), 50/50 VUs, 15096 complete and 0 interrupted iterations
satu_juta_transaksi   [  63% ] 50/50 VUs  0m38.0s/1m00.0s

running (0m39.0s), 50/50 VUs, 15562 complete and 0 interrupted iterations
satu_juta_transaksi   [  65% ] 50/50 VUs  0m39.0s/1m00.0s

running (0m40.0s), 50/50 VUs, 16021 complete and 0 interrupted iterations
satu_juta_transaksi   [  67% ] 50/50 VUs  0m40.0s/1m00.0s

running (0m41.0s), 50/50 VUs, 16478 complete and 0 interrupted iterations
satu_juta_transaksi   [  68% ] 50/50 VUs  0m41.0s/1m00.0s

running (0m42.0s), 50/50 VUs, 16945 complete and 0 interrupted iterations
satu_juta_transaksi   [  70% ] 50/50 VUs  0m42.0s/1m00.0s

running (0m43.0s), 50/50 VUs, 17380 complete and 0 interrupted iterations
satu_juta_transaksi   [  72% ] 50/50 VUs  0m43.0s/1m00.0s

running (0m44.0s), 50/50 VUs, 17840 complete and 0 interrupted iterations
satu_juta_transaksi   [  73% ] 50/50 VUs  0m44.0s/1m00.0s

running (0m45.0s), 50/50 VUs, 18299 complete and 0 interrupted iterations
satu_juta_transaksi   [  75% ] 50/50 VUs  0m45.0s/1m00.0s

running (0m46.0s), 50/50 VUs, 18767 complete and 0 interrupted iterations
satu_juta_transaksi   [  77% ] 50/50 VUs  0m46.0s/1m00.0s

running (0m47.0s), 50/50 VUs, 19229 complete and 0 interrupted iterations
satu_juta_transaksi   [  78% ] 50/50 VUs  0m47.0s/1m00.0s

running (0m48.0s), 50/50 VUs, 19689 complete and 0 interrupted iterations
satu_juta_transaksi   [  80% ] 50/50 VUs  0m48.0s/1m00.0s

running (0m49.0s), 50/50 VUs, 20155 complete and 0 interrupted iterations
satu_juta_transaksi   [  82% ] 50/50 VUs  0m49.0s/1m00.0s

running (0m50.0s), 50/50 VUs, 20606 complete and 0 interrupted iterations
satu_juta_transaksi   [  83% ] 50/50 VUs  0m50.0s/1m00.0s

running (0m51.0s), 46/50 VUs, 21048 complete and 0 interrupted iterations
satu_juta_transaksi   [  85% ] 46/50 VUs  0m51.0s/1m00.0s

running (0m52.0s), 41/50 VUs, 21455 complete and 0 interrupted iterations
satu_juta_transaksi   [  87% ] 41/50 VUs  0m52.0s/1m00.0s

running (0m53.0s), 36/50 VUs, 21794 complete and 0 interrupted iterations
satu_juta_transaksi   [  88% ] 36/50 VUs  0m53.0s/1m00.0s

running (0m54.0s), 31/50 VUs, 22100 complete and 0 interrupted iterations
satu_juta_transaksi   [  90% ] 31/50 VUs  0m54.0s/1m00.0s

running (0m55.0s), 26/50 VUs, 22361 complete and 0 interrupted iterations
satu_juta_transaksi   [  92% ] 26/50 VUs  0m55.0s/1m00.0s

running (0m56.0s), 21/50 VUs, 22572 complete and 0 interrupted iterations
satu_juta_transaksi   [  93% ] 21/50 VUs  0m56.0s/1m00.0s

running (0m57.0s), 16/50 VUs, 22738 complete and 0 interrupted iterations
satu_juta_transaksi   [  95% ] 16/50 VUs  0m57.0s/1m00.0s

running (0m58.0s), 11/50 VUs, 22859 complete and 0 interrupted iterations
satu_juta_transaksi   [  97% ] 11/50 VUs  0m58.0s/1m00.0s

running (0m59.0s), 06/50 VUs, 22936 complete and 0 interrupted iterations
satu_juta_transaksi   [  98% ] 06/50 VUs  0m59.0s/1m00.0s

running (1m00.0s), 01/50 VUs, 22969 complete and 0 interrupted iterations
satu_juta_transaksi   [ 100% ] 01/50 VUs  1m00.0s/1m00.0s


  Γûê THRESHOLDS 

    http_req_duration
    Γ£ô 'p(95)<500' p(95)=8.48ms

    http_req_failed
    Γ£ô 'rate<0.01' rate=0.00%


  Γûê TOTAL RESULTS 

    checks_total.......: 45940   765.085261/s
    checks_succeeded...: 100.00% 45940 out of 45940
    checks_failed......: 0.00%   0 out of 45940

    Γ£ô Γ£ô Cek Saldo 200
    Γ£ô Γ£ô Transfer 202 (Masuk Antrean)

    HTTP
    http_req_duration..............: avg=4.06ms   min=0s       med=3.7ms    max=41.53ms  p(90)=6.72ms   p(95)=8.48ms  
      { expected_response:true }...: avg=4.06ms   min=0s       med=3.7ms    max=41.53ms  p(90)=6.72ms   p(95)=8.48ms  
    http_req_failed................: 0.00%  0 out of 45940
    http_reqs......................: 45940  765.085261/s

    EXECUTION
    iteration_duration.............: avg=108.94ms min=101.56ms med=108.44ms max=153.55ms p(90)=114.43ms p(95)=117.85ms
    iterations.....................: 22970  382.54263/s
    vus............................: 1      min=1          max=50
    vus_max........................: 50     min=50         max=50

    NETWORK
    data_received..................: 14 MB  227 kB/s
    data_sent......................: 7.9 MB 132 kB/s



running (1m00.0s), 00/50 VUs, 22970 complete and 0 interrupted iterations
satu_juta_transaksi Γ£ô [ 100% ] 00/50 VUs  1m0s